loadtest/.runs3/log-100.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/capacidade.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 1m10s max duration (incl. graceful stop):
              * navegacao: Up to 100 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 009/100 VUs, 0 complete and 0 interrupted iterations
navegacao   [   2% ] 009/100 VUs  01.0s/40.0s

running (0m02.0s), 019/100 VUs, 0 complete and 0 interrupted iterations
navegacao   [   5% ] 019/100 VUs  02.0s/40.0s

running (0m03.0s), 029/100 VUs, 15 complete and 0 interrupted iterations
navegacao   [   7% ] 029/100 VUs  03.0s/40.0s

running (0m04.0s), 039/100 VUs, 26 complete and 0 interrupted iterations
navegacao   [  10% ] 039/100 VUs  04.0s/40.0s

running (0m05.0s), 049/100 VUs, 57 complete and 0 interrupted iterations
navegacao   [  12% ] 049/100 VUs  05.0s/40.0s

running (0m06.0s), 059/100 VUs, 88 complete and 0 interrupted iterations
navegacao   [  15% ] 059/100 VUs  06.0s/40.0s

running (0m07.0s), 069/100 VUs, 127 complete and 0 interrupted iterations
navegacao   [  17% ] 069/100 VUs  07.0s/40.0s

running (0m08.0s), 079/100 VUs, 177 complete and 0 interrupted iterations
navegacao   [  20% ] 079/100 VUs  08.0s/40.0s

running (0m09.0s), 089/100 VUs, 213 complete and 0 interrupted iterations
navegacao   [  22% ] 089/100 VUs  09.0s/40.0s

running (0m10.0s), 099/100 VUs, 232 complete and 0 interrupted iterations
navegacao   [  25% ] 099/100 VUs  10.0s/40.0s

running (0m11.0s), 100/100 VUs, 250 complete and 0 interrupted iterations
navegacao   [  27% ] 100/100 VUs  11.0s/40.0s

running (0m12.0s), 100/100 VUs, 272 complete and 0 interrupted iterations
navegacao   [  30% ] 100/100 VUs  12.0s/40.0s

running (0m13.0s), 100/100 VUs, 368 complete and 0 interrupted iterations
navegacao   [  32% ] 100/100 VUs  13.0s/40.0s

running (0m14.0s), 100/100 VUs, 428 complete and 0 interrupted iterations
navegacao   [  35% ] 100/100 VUs  14.0s/40.0s

running (0m15.0s), 100/100 VUs, 520 complete and 0 interrupted iterations
navegacao   [  37% ] 100/100 VUs  15.0s/40.0s

running (0m16.0s), 100/100 VUs, 558 complete and 0 interrupted iterations
navegacao   [  40% ] 100/100 VUs  16.0s/40.0s

running (0m17.0s), 100/100 VUs, 654 complete and 0 interrupted iterations
navegacao   [  42% ] 100/100 VUs  17.0s/40.0s

running (0m18.0s), 100/100 VUs, 688 complete and 0 interrupted iterations
navegacao   [  45% ] 100/100 VUs  18.0s/40.0s

running (0m19.0s), 100/100 VUs, 782 complete and 0 interrupted iterations
navegacao   [  47% ] 100/100 VUs  19.0s/40.0s

running (0m20.0s), 100/100 VUs, 840 complete and 0 interrupted iterations
navegacao   [  50% ] 100/100 VUs  20.0s/40.0s

running (0m21.0s), 100/100 VUs, 926 complete and 0 interrupted iterations
navegacao   [  52% ] 100/100 VUs  21.0s/40.0s

running (0m22.0s), 100/100 VUs, 1019 complete and 0 interrupted iterations
navegacao   [  55% ] 100/100 VUs  22.0s/40.0s

running (0m23.0s), 100/100 VUs, 1110 complete and 0 interrupted iterations
navegacao   [  57% ] 100/100 VUs  23.0s/40.0s

running (0m24.0s), 100/100 VUs, 1198 complete and 0 interrupted iterations
navegacao   [  60% ] 100/100 VUs  24.0s/40.0s

running (0m25.0s), 100/100 VUs, 1270 complete and 0 interrupted iterations
navegacao   [  62% ] 100/100 VUs  25.0s/40.0s

running (0m26.0s), 100/100 VUs, 1313 complete and 0 interrupted iterations
navegacao   [  65% ] 100/100 VUs  26.0s/40.0s

running (0m27.0s), 100/100 VUs, 1405 complete and 0 interrupted iterations
navegacao   [  67% ] 100/100 VUs  27.0s/40.0s

running (0m28.0s), 100/100 VUs, 1503 complete and 0 interrupted iterations
navegacao   [  70% ] 100/100 VUs  28.0s/40.0s

running (0m29.0s), 100/100 VUs, 1556 complete and 0 interrupted iterations
navegacao   [  72% ] 100/100 VUs  29.0s/40.0s

running (0m30.0s), 100/100 VUs, 1651 complete and 0 interrupted iterations
navegacao   [  75% ] 100/100 VUs  30.0s/40.0s

running (0m31.0s), 100/100 VUs, 1700 complete and 0 interrupted iterations
navegacao   [  77% ] 100/100 VUs  31.0s/40.0s

running (0m32.0s), 100/100 VUs, 1797 complete and 0 interrupted iterations
navegacao   [  80% ] 100/100 VUs  32.0s/40.0s

running (0m33.0s), 100/100 VUs, 1887 complete and 0 interrupted iterations
navegacao   [  82% ] 100/100 VUs  33.0s/40.0s

running (0m34.0s), 100/100 VUs, 1960 complete and 0 interrupted iterations
navegacao   [  85% ] 100/100 VUs  34.0s/40.0s

running (0m35.0s), 100/100 VUs, 2048 complete and 0 interrupted iterations
navegacao   [  87% ] 100/100 VUs  35.0s/40.0s

running (0m36.0s), 096/100 VUs, 2095 complete and 0 interrupted iterations
navegacao   [  90% ] 096/100 VUs  36.0s/40.0s

running (0m37.0s), 074/100 VUs, 2183 complete and 0 interrupted iterations
navegacao   [  92% ] 074/100 VUs  37.0s/40.0s

running (0m38.0s), 050/100 VUs, 2255 complete and 0 interrupted iterations
navegacao   [  95% ] 050/100 VUs  38.0s/40.0s

running (0m39.0s), 032/100 VUs, 2302 complete and 0 interrupted iterations
navegacao   [  97% ] 032/100 VUs  39.0s/40.0s

running (0m40.0s), 012/100 VUs, 2333 complete and 0 interrupted iterations
navegacao   [ 100% ] 012/100 VUs  40.0s/40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=364.68ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 9480    232.075466/s
    checks_succeeded...: 100.00% 9480 out of 9480
    checks_failed......: 0.00%   0 out of 9480

    ✓ login: redireciona (302/303)
    ✓ home: 200 e autenticado
    ✓ lista ativos: 200 e autenticado
    ✓ busca ativos: 200 e autenticado
    ✓ lista chamados: 200 e autenticado

    HTTP
    http_req_duration..............: avg=99.48ms min=5.59ms med=43.41ms max=1.84s p(90)=246.82ms p(95)=364.68ms
      { expected_response:true }...: avg=99.48ms min=5.59ms med=43.41ms max=1.84s p(90)=246.82ms p(95)=364.68ms
    http_req_failed................: 0.00%  0 out of 9580
    http_reqs......................: 9580   234.523519/s

    EXECUTION
    iteration_duration.............: avg=1.4s    min=1.03s  med=1.22s   max=4.5s  p(90)=1.86s    p(95)=2.24s   
    iterations.....................: 2345   57.406853/s
    vus............................: 12     min=9         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 272 MB 6.7 MB/s
    data_sent......................: 1.4 MB 34 kB/s



running (0m40.8s), 000/100 VUs, 2345 complete and 0 interrupted iterations
navegacao ✓ [ 100% ] 000/100 VUs  40s