loadtest/.runs3/log-150.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/capacidade.js
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 1m10s max duration (incl. graceful stop):
              * navegacao: Up to 150 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 014/150 VUs, 0 complete and 0 interrupted iterations
navegacao   [   2% ] 014/150 VUs  01.0s/40.0s

running (0m02.0s), 029/150 VUs, 11 complete and 0 interrupted iterations
navegacao   [   5% ] 029/150 VUs  02.0s/40.0s

running (0m03.0s), 044/150 VUs, 34 complete and 0 interrupted iterations
navegacao   [   7% ] 044/150 VUs  03.0s/40.0s

running (0m04.0s), 059/150 VUs, 70 complete and 0 interrupted iterations
navegacao   [  10% ] 059/150 VUs  04.0s/40.0s

running (0m05.0s), 074/150 VUs, 120 complete and 0 interrupted iterations
navegacao   [  12% ] 074/150 VUs  05.0s/40.0s

running (0m06.0s), 089/150 VUs, 152 complete and 0 interrupted iterations
navegacao   [  15% ] 089/150 VUs  06.0s/40.0s

running (0m07.0s), 104/150 VUs, 212 complete and 0 interrupted iterations
navegacao   [  17% ] 104/150 VUs  07.0s/40.0s

running (0m08.0s), 119/150 VUs, 246 complete and 0 interrupted iterations
navegacao   [  20% ] 119/150 VUs  08.0s/40.0s

running (0m09.0s), 134/150 VUs, 300 complete and 0 interrupted iterations
navegacao   [  22% ] 134/150 VUs  09.0s/40.0s

running (0m10.0s), 149/150 VUs, 356 complete and 0 interrupted iterations
navegacao   [  25% ] 149/150 VUs  10.0s/40.0s

running (0m11.0s), 150/150 VUs, 400 complete and 0 interrupted iterations
navegacao   [  27% ] 150/150 VUs  11.0s/40.0s

running (0m12.0s), 150/150 VUs, 464 complete and 0 interrupted iterations
navegacao   [  30% ] 150/150 VUs  12.0s/40.0s

running (0m13.0s), 150/150 VUs, 567 complete and 0 interrupted iterations
navegacao   [  32% ] 150/150 VUs  13.0s/40.0s

running (0m14.0s), 150/150 VUs, 602 complete and 0 interrupted iterations
navegacao   [  35% ] 150/150 VUs  14.0s/40.0s

running (0m15.0s), 150/150 VUs, 702 complete and 0 interrupted iterations
navegacao   [  37% ] 150/150 VUs  15.0s/40.0s

running (0m16.0s), 150/150 VUs, 816 complete and 0 interrupted iterations
navegacao   [  40% ] 150/150 VUs  16.0s/40.0s

running (0m17.0s), 150/150 VUs, 915 complete and 0 interrupted iterations
navegacao   [  42% ] 150/150 VUs  17.0s/40.0s

running (0m18.0s), 150/150 VUs, 993 complete and 0 interrupted iterations
navegacao   [  45% ] 150/150 VUs  18.0s/40.0s

running (0m19.0s), 150/150 VUs, 1066 complete and 0 interrupted iterations
navegacao   [  47% ] 150/150 VUs  19.0s/40.0s

running (0m20.0s), 150/150 VUs, 1154 complete and 0 interrupted iterations
navegacao   [  50% ] 150/150 VUs  20.0s/40.0s

running (0m21.0s), 150/150 VUs, 1254 complete and 0 interrupted iterations
navegacao   [  52% ] 150/150 VUs  21.0s/40.0s

running (0m22.0s), 150/150 VUs, 1333 complete and 0 interrupted iterations
navegacao   [  55% ] 150/150 VUs  22.0s/40.0s

running (0m23.0s), 150/150 VUs, 1417 complete and 0 interrupted iterations
navegacao   [  57% ] 150/150 VUs  23.0s/40.0s

running (0m24.0s), 150/150 VUs, 1491 complete and 0 interrupted iterations
navegacao   [  60% ] 150/150 VUs  24.0s/40.0s

running (0m25.0s), 150/150 VUs, 1635 complete and 0 interrupted iterations
navegacao   [  62% ] 150/150 VUs  25.0s/40.0s

running (0m26.0s), 150/150 VUs, 1673 complete and 0 interrupted iterations
navegacao   [  65% ] 150/150 VUs  26.0s/40.0s

running (0m27.0s), 150/150 VUs, 1764 complete and 0 interrupted iterations
navegacao   [  67% ] 150/150 VUs  27.0s/40.0s

running (0m28.0s), 150/150 VUs, 1865 complete and 0 interrupted iterations
navegacao   [  70% ] 150/150 VUs  28.0s/40.0s

running (0m29.0s), 150/150 VUs, 1912 complete and 0 interrupted iterations
navegacao   [  72% ] 150/150 VUs  29.0s/40.0s

running (0m30.0s), 150/150 VUs, 2030 complete and 0 interrupted iterations
navegacao   [  75% ] 150/150 VUs  30.0s/40.0s

running (0m31.0s), 150/150 VUs, 2117 complete and 0 interrupted iterations
navegacao   [  77% ] 150/150 VUs  31.0s/40.0s

running (0m32.0s), 150/150 VUs, 2235 complete and 0 interrupted iterations
navegacao   [  80% ] 150/150 VUs  32.0s/40.0s

running (0m33.0s), 150/150 VUs, 2299 complete and 0 interrupted iterations
navegacao   [  82% ] 150/150 VUs  33.0s/40.0s

running (0m34.0s), 150/150 VUs, 2346 complete and 0 interrupted iterations
navegacao   [  85% ] 150/150 VUs  34.0s/40.0s

running (0m35.0s), 150/150 VUs, 2469 complete and 0 interrupted iterations
navegacao   [  87% ] 150/150 VUs  35.0s/40.0s

running (0m36.0s), 145/150 VUs, 2543 complete and 0 interrupted iterations
navegacao   [  90% ] 145/150 VUs  36.0s/40.0s

running (0m37.0s), 131/150 VUs, 2585 complete and 0 interrupted iterations
navegacao   [  92% ] 131/150 VUs  37.0s/40.0s

running (0m38.0s), 069/150 VUs, 2713 complete and 0 interrupted iterations
navegacao   [  95% ] 069/150 VUs  38.0s/40.0s

running (0m39.0s), 043/150 VUs, 2781 complete and 0 interrupted iterations
navegacao   [  97% ] 043/150 VUs  39.0s/40.0s

running (0m40.0s), 015/150 VUs, 2824 complete and 0 interrupted iterations
navegacao   [ 100% ] 015/150 VUs  40.0s/40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=513.9ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11506   282.419738/s
    checks_succeeded...: 100.00% 11506 out of 11506
    checks_failed......: 0.00%   0 out of 11506

    ✓ login: redireciona (302/303)
    ✓ home: 200 e autenticado
    ✓ lista ativos: 200 e autenticado
    ✓ busca ativos: 200 e autenticado
    ✓ lista chamados: 200 e autenticado

    HTTP
    http_req_duration..............: avg=182.6ms min=3.59ms med=134.83ms max=1.3s  p(90)=412.05ms p(95)=513.9ms
      { expected_response:true }...: avg=182.6ms min=3.59ms med=134.83ms max=1.3s  p(90)=412.05ms p(95)=513.9ms
    http_req_failed................: 0.00%  0 out of 11656
    http_reqs......................: 11656  286.101552/s

    EXECUTION
    iteration_duration.............: avg=1.75s   min=1.03s  med=1.7s     max=3.77s p(90)=2.38s    p(95)=2.58s  
    iterations.....................: 2839   69.684481/s
    vus............................: 15     min=14         max=150
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 329 MB 8.1 MB/s
    data_sent......................: 1.7 MB 42 kB/s



running (0m40.7s), 000/150 VUs, 2839 complete and 0 interrupted iterations
navegacao ✓ [ 100% ] 000/150 VUs  40s